ycsb-results-mssqlnotok/mongodb/f/rc1000-op1000/tc8/run1.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.AsyncMongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27023 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadf -p recordcount=1000 -threads 8 -p operationcount=1000
mongo connection created with mongodb://172.16.13.26:27023
[OVERALL], RunTime(ms), 212
[OVERALL], Throughput(ops/sec), 4716.981132075472
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 7
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 3.30188679245283
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 7
[TOTAL_GC_TIME_%], Time(%), 3.30188679245283
[READ], Operations, 1000
[READ], AverageLatency(us), 863.645
[READ], MinLatency(us), 126
[READ], MaxLatency(us), 36287
[READ], 95thPercentileLatency(us), 1435
[READ], 99thPercentileLatency(us), 9655
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 479
[READ-MODIFY-WRITE], AverageLatency(us), 2006.2045929018789
[READ-MODIFY-WRITE], MinLatency(us), 381
[READ-MODIFY-WRITE], MaxLatency(us), 49983
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 4143
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 48959
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 544.375
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 4347
[CLEANUP], 95thPercentileLatency(us), 4347
[CLEANUP], 99thPercentileLatency(us), 4347
[UPDATE], Operations, 479
[UPDATE], AverageLatency(us), 749.6200417536535
[UPDATE], MinLatency(us), 205
[UPDATE], MaxLatency(us), 12247
[UPDATE], 95thPercentileLatency(us), 2077
[UPDATE], 99thPercentileLatency(us), 4307
[UPDATE], Return=OK, 479